# DataFrame Eleman İşlemleri

In [1]:
import numpy as np
import pandas as pd

In [3]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({'var1': s1, 'var2': s2, 'var3': s3})
df

   var1  var2  var3
0     9     0     7
1     5     5     1
2     9     3     2
3     6     6     5
4     3     5     3

In [4]:
df[0:1]

   var1  var2  var3
0     9     0     7

### Gözlem Seçme işlemleri

In [6]:
df.index = ['a','b','c','d','e']
df

   var1  var2  var3
a     9     0     7
b     5     5     1
c     9     3     2
d     6     6     5
e     3     5     3

In [7]:
df['c':'d']

   var1  var2  var3
c     9     3     2
d     6     6     5

In [14]:
df

   var1  var2  var3
a     9     0     7
b     5     5     1
c     9     3     2
d     6     6     5
e     3     5     3

In [18]:
df.drop('a', axis = 0)

   var1  var2  var3
b     5     5     1
c     9     3     2
d     6     6     5
e     3     5     3

In [19]:
df.drop('a', axis = 0, inplace = True) # İnplace agrümanı ile yapılan değişikliğin kalıcı olmasını sağlıyoruz

In [20]:
df

   var1  var2  var3
b     5     5     1
c     9     3     2
d     6     6     5
e     3     5     3

In [21]:
l = ['b','c']
l

['b', 'c']

In [22]:
df.drop(l, axis = 0) #Birden fazla index silme işlemi

   var1  var2  var3
d     6     6     5
e     3     5     3

### Değişkenlere erişmek ve değişken seçim işlemleri

In [25]:
'var1' in df # Değişkenin olup olmadığını sorgulama

True

In [29]:
l = ['var1','var2', 'var4']
l

['var1', 'var2', 'var4']

In [30]:
for i in l:
    print(i in df)

True
True
False

In [31]:
df['var1'] is df['var2'] # iki değişkenin aynı olup olmadığını(kopyası mı) kontrol etmek

False

In [32]:
df['var1'] is df['var1']

True

In [33]:
df['var2'] #Değişken seçme (Sözcük tipi seçme)

b    5
c    3
d    6
e    5
Name: var2, dtype: int64

In [35]:
df.var1 #Değişken seçme (Attribute tipi seçme)

b    5
c    9
d    6
e    3
Name: var1, dtype: int64

In [37]:
df[['var1', 'var2']] # İki değişkeni aynı anda seçme

   var1  var2
b     5     5
c     9     3
d     6     6
e     3     5

In [38]:
l = ['var1', 'var2']

In [40]:
df[l] # Birden fazla değişken seçmek istediğimizde içerisine liste vererek gerçekleştirebiliriz.

   var1  var2
b     5     5
c     9     3
d     6     6
e     3     5

In [72]:
df['var4'] = df['var1'] / df['var2'] #Yeni bir değişkeni var olan değişkenler üzerinden işlem yaparak oluşturma
df

   var1  var2  var3  var4
b     5     5     1   1.0
c     9     3     2   3.0
d     6     6     5   1.0
e     3     5     3   0.6

In [68]:
df

   var1  var2  var3
b     5     5     1
c     9     3     2
d     6     6     5
e     3     5     3

In [65]:
df.drop('var4', axis = 1) # Değişken silme (Kalıcı olmayan)

   var1  var2  var3
b     5     5     1
c     9     3     2
d     6     6     5
e     3     5     3

In [73]:
df.drop('var4', axis = 1, inplace = True) #(kalıcı silme)
df

   var1  var2  var3
b     5     5     1
c     9     3     2
d     6     6     5
e     3     5     3

In [75]:
df.drop(l, axis = 1) # Verilen bir listeye göre değişkenleri silme

   var3
b     1
c     2
d     5
e     3

## Gözlem ve Değişkenlere birlikte erişmek

In [76]:
#NOT: Genel olaral loc ve iloc kullanılmalı

In [77]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({'var1': s1, 'var2': s2, 'var3': s3})
df

   var1  var2  var3
0     5     0     2
1     5     4     1
2     0     8     8
3     0     1     5
4     8     4     5

In [79]:
df.loc[0:3]

   var1  var2  var3
0     5     0     2
1     5     4     1
2     0     8     8
3     0     1     5

In [80]:
df.iloc[0:3]

   var1  var2  var3
0     5     0     2
1     5     4     1
2     0     8     8

In [81]:
df.iloc[0,0]

5

In [82]:
df.iloc[:3,:2]

   var1  var2
0     5     0
1     5     4
2     0     8

In [84]:
df.loc[0:3, 'var3']

0    2
1    1
2    8
3    5
Name: var3, dtype: int64

In [85]:
df.loc[0:3, 'var2':'var3']

   var2  var3
0     0     2
1     4     1
2     8     8
3     1     5

In [87]:
df.index = ['a','b','c','d','e']
df

   var1  var2  var3
a     5     0     2
b     5     4     1
c     0     8     8
d     0     1     5
e     8     4     5

In [88]:
df.loc['a':'c', 'var1':'var2']

   var1  var2
a     5     0
b     5     4
c     0     8

## Koşullu eleman işlemleri

In [92]:
df[df.var1 >5]['var2']

e    4
Name: var2, dtype: int64

In [96]:
df[(df.var1 > 5) & (df.var3 < 7)]

   var1  var2  var3
e     8     4     5

In [98]:
df.loc[df.var1 > 5, ['var1','var2']]

   var1  var2
e     8     4